In [1]:
import pandas as pd
import numpy as np

# Ufuncs: Index Preservation

In [4]:
rng = np.random.RandomState(52)
ser = pd.Series(rng.randint(0, 15, 5))
ser

0     5
1    12
2    11
3    13
4     7
dtype: int32

In [5]:
df = pd.DataFrame(rng.randint(0, 15, (3, 4)),
                  columns = ['A', 'B', 'C', 'D'])
df

    A   B   C   D
0   6  12   7   0
1   5  10  11  11
2  10   3   3   1

In [6]:
np.exp(ser)

0       148.413159
1    162754.791419
2     59874.141715
3    442413.392009
4      1096.633158
dtype: float64

In [7]:
np.sin(df * np.pi / 4)

          A             B         C         D
0 -1.000000  3.673940e-16 -0.707107  0.000000
1 -0.707107  1.000000e+00  0.707107  0.707107
2  1.000000  7.071068e-01  0.707107  0.707107

# UFuncs: Index Alignment

## Index alignment in Series

In [8]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name = 'area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name = 'population')

In [9]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [13]:
# area.index.union() | population.index  deprecated
area.index.union(population.index)

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [14]:
A = pd.Series([2, 4, 6], index = [0, 1, 2])
B = pd.Series([1, 3, 5], index = [1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [15]:
A.add(B, fill_value = 0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

## Index alignment in DataFrame

In [16]:
A = pd.DataFrame(rng.randint(0, 25, (2, 2)),
                 columns = list('AB'))
A

   A   B
0  3   1
1  5  17

In [18]:
B = pd.DataFrame(rng.randint(0, 13, (3, 3)),
                 columns = list('BAC'))
B

    B   A  C
0   0  11  0
1   6  10  6
2  12   7  9

In [19]:
A + B

      A     B   C
0  14.0   1.0 NaN
1  15.0  23.0 NaN
2   NaN   NaN NaN

In [22]:
fill = A.stack().mean()
A.add(B, fill_value = fill)

      A     B     C
0  14.0   1.0   6.5
1  15.0  23.0  12.5
2  13.5  18.5  15.5

# Ufuncs: Operations Between DataFrame and Series

In [23]:
A = rng.randint(12, size = (3, 4))
A

array([[ 4,  6,  7,  7],
       [ 7,  4,  2,  5],
       [11,  4, 10,  0]])

In [24]:
A - A[0]

array([[ 0,  0,  0,  0],
       [ 3, -2, -5, -2],
       [ 7, -2,  3, -7]])

In [25]:
df = pd.DataFrame(A, columns = list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1  3 -2 -5 -2
2  7 -2  3 -7

In [27]:
df.subtract(df['R'], axis = 0)

   Q  R  S  T
0 -2  0  1  1
1  3  0 -2  1
2  7  0  6 -4

In [28]:
halfrow = df.iloc[0, ::2]
halfrow

Q    4
S    7
Name: 0, dtype: int32

In [29]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1  3.0 NaN -5.0 NaN
2  7.0 NaN  3.0 NaN